# -------------------- NOTES -------------------------#

In [1]:
import pandas as pd 
import numpy as np 
np.random.seed(123)

# Create list of values for names column.

students = ['Sally', 'Jane', 'Suzie', 'Billy', 'Ada', 'John', 'Thomas',
            'Marie', 'Albert', 'Richard', 'Isaac', 'Alan']

# Randomly generate arrays of scores for each student for each subject.
# Note that all the values need to have the same length here.

math_grades = np.random.randint(low=60, high=100, size=len(students))
english_grades = np.random.randint(low=60, high=100, size=len(students))
reading_grades = np.random.randint(low=60, high=100, size=len(students))

# Construct the DataFrame using the above lists and arrays.

df = pd.DataFrame({'name': students,
                   'math': math_grades,
                   'english': english_grades,
                   'reading': reading_grades,
                   'classroom': np.random.choice(['A', 'B'], len(students))})

In [2]:
pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6]}) #from dictionary
pd.DataFrame([[1, 2, 3], [4, 5, 6]]) #from 2D array

array = np.array([[1, 2, 3], [4, 5, 6]])
pd.DataFrame(array, columns=['a', 'b', 'c']) #from 2D array with specified names

   a  b  c
0  1  2  3
1  4  5  6

In [4]:
from env import host, user, password

url = f'mysql+pymysql://{user}:{password}@{host}/employees'

In [6]:
import numpy as np
import pandas as pd

In [10]:
pd.read_sql('select * from employees limit 5', url)

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2   10003  1959-12-03      Parto   Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12

# --------------------------- EXERCISES ----------------------------- #

In [16]:
#Create a function named get_db_url. 
#It should accept a username, hostname, password, and database name 
#and return a url connection string formatted like in the example at the start of this lesson.

from env import host, user, password

def get_db_url(user,host,password,db):
    url =  f'mysql+pymysql://{user}:{password}@{host}/employees'
    return url

get_db_url(user,host,password,db)

'mysql+pymysql://ursula_2336:G1qhYOM5plWejcpe8ndDfNTqDqlljZiF@data.codeup.com/employees'

In [17]:
#Use your function to obtain a connection to the employees database.
pd.read_sql('select * from employees limit 2', url)

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel    Simmel      F  1985-11-21

In [ ]:
#Intentionally make a typo in the database url. What kind of error message do you see?
pd.read_sql('select * from employees limit 2', 'mysql+pymysql://ursula_2336:G1qhYOM5plWejcpe8ndDfNTqDqlljZiF@data.codeup.com/employee')
# it shows 'access denied'

In [ ]:
#Intentionally make an error in your SQL query. What does the error message look like?
pd.read_sql('select from employees limit 2', url)
# it shows programming error

In [26]:
# Read the employees and titles tables into two separate DataFrames.
employees = pd.read_sql(
    '''
select *
from employees

''', url)

titles = pd.read_sql(
    '''
select *
from titles

''', url)

In [29]:
#How many rows and columns do you have in each DataFrame? Is that what you expected?
print(employees.shape)
print(titles.shape)

(300024, 6)
(443308, 4)

In [31]:
#Display the summary statistics for each DataFrame.
print(employees.info)
print(titles)

<bound method DataFrame.info of         emp_no  birth_date first_name last_name gender   hire_date
0        10001  1953-09-02     Georgi   Facello      M  1986-06-26
1        10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2        10003  1959-12-03      Parto   Bamford      M  1986-08-28
3        10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4        10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12
...        ...         ...        ...       ...    ...         ...
300019  499995  1958-09-24     Dekang  Lichtner      F  1993-01-12
300020  499996  1953-03-07       Zito      Baaz      M  1990-09-27
300021  499997  1961-08-03    Berhard    Lenart      M  1986-04-21
300022  499998  1956-09-05   Patricia   Breugel      M  1993-10-13
300023  499999  1958-05-01     Sachin   Tsukuda      M  1997-11-30

[300024 rows x 6 columns]>
        emp_no            title   from_date     to_date
0        10001  Senior Engineer  1986-06-26  9999-01-01
1        10002            Staff  1996-08-03  9999-01-01
2        10003  Senior Engineer  1995-12-03  9999-01-01
3        10004         Engineer  1986-12-01  1995-12-01
4        10004  Senior Engineer  1995-12-01  9999-01-01
...        ...              ...         ...         ...
443303  499997         Engineer  1987-08-30  1992-08-29
443304  499997  Senior Engineer  1992-08-29  9999-01-01
443305  499998     Senior Staff  1998-12-27  9999-01-01
443306  499998            Staff  1993-12-27  1998-12-27
443307  499999         Engineer  1997-11-30  9999-01-01

[443308 rows x 4 columns]

In [42]:
#How many unique titles are in the titles DataFrame?
titles.title.unique()

array(['Senior Engineer', 'Staff', 'Engineer', 'Senior Staff',
       'Assistant Engineer', 'Technique Leader', 'Manager'], dtype=object)

In [40]:
#What is the oldest date in the to_date column? What is the most recent date in the to_date column?
print(titles.to_date.max())
print(titles.to_date.min())

9999-01-01
1985-03-01